Revit 2024 API
WireMaterialType.AddTemperatureRatingType Method
 Add a new temperature rating type into material type.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public TemperatureRatingType AddTemperatureRatingType(
	string name,
	TemperatureRatingType baseOn
)
Visual Basic
Public Function AddTemperatureRatingType ( _
	name As String, _
	baseOn As TemperatureRatingType _
) As TemperatureRatingType
Visual C++
public:
TemperatureRatingType^ AddTemperatureRatingType(
	String^ name,
	TemperatureRatingType^ baseOn
)
Parameters
name
Type: System.String
Name of temperature type to be added.
baseOn
Type: Autodesk.Revit.DB.Electrical.TemperatureRatingType
The new temperature rating will be created base on this existing temperature rating type.
Return Value
New constructed temperature rating type.
See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace